In [1]:
import pymysql
import pandas as pd
import sqlalchemy.engine

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:password@127.0.0.1:3306/sadgi

In [4]:
%sql alter table employees add `Mail` varchar(50)

 * mysql+pymysql://root:***@127.0.0.1:3306/sadgi
(pymysql.err.OperationalError) (1060, "Duplicate column name 'Mail'")
[SQL: alter table employees add `Mail` varchar(50)]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [5]:
c=%%sql
select * from employees

 * mysql+pymysql://root:***@127.0.0.1:3306/sadgi
3 rows affected.

[('E1001', 'JOHN', 'THOMAS', 12345, datetime.date(1976, 1, 9), 'M', '5631 RICE OAK TREE', 100, 10000, 30001, 2, None, None),
 ('E1002', 'ALICE', 'JAMES', 1234567, datetime.date(1972, 7, 31), 'F', '900 BERRY LANE', 200, 80000, 30002, 5, None, None),
 ('E1003', 'STEVE', 'WELLS', 123458, datetime.date(1980, 8, 25), 'M', '291 SPRING TREE', 300, 50000, 30002, 5, None, None)]

In [6]:
d=%sql select * from INFORMATION_SCHEMA.TABLES

 * mysql+pymysql://root:***@127.0.0.1:3306/sadgi
341 rows affected.

In [33]:
%sql select "e_mail" from employees where job_id=200

 * mysql+pymysql://root:***@127.0.0.1:3306/sadgi
(pymysql.err.OperationalError) (1054, "Unknown column 'e_mail' in 'field list'")
[SQL: select e_mail from employees where job_id=200]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
df=pd.DataFrame(d)
df.head()

,0,1,2,3,4,5,6,7,8,9,...,11,12,13,14,15,16,17,18,19,20
0,def,mysql,innodb_table_stats,BASE TABLE,InnoDB,10.0,Dynamic,14.0,1170.0,16384.0,...,0.0,4194304.0,NaN,2021-07-21 08:04:38,None,None,utf8_bin,None,row_format=DYNAMIC stats_persistent=0,
1,def,mysql,innodb_index_stats,BASE TABLE,InnoDB,10.0,Dynamic,42.0,390.0,16384.0,...,0.0,4194304.0,NaN,2021-07-21 08:04:38,None,None,utf8_bin,None,row_format=DYNAMIC stats_persistent=0,
2,def,information_schema,CHARACTER_SETS,SYSTEM VIEW,None,10.0,None,0.0,0.0,0.0,...,0.0,0.0,NaN,2021-07-21 13:34:57,None,None,None,None,,
3,def,information_schema,CHECK_CONSTRAINTS,SYSTEM VIEW,None,10.0,None,0.0,0.0,0.0,...,0.0,0.0,NaN,2021-07-21 13:34:57,None,None,None,None,,
4,def,information_schema,COLLATIONS,SYSTEM VIEW,None,10.0,None,0.0,0.0,0.0,...,0.0,0.0,NaN,2021-07-21 13:34:57,None,None,None,None,,